Documents/ПриходПроцентовМНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходПроцентовМНО</Name>
			<BasedOn>
				<xr:Item>Document.МНО</xr:Item>
				<xr:Item>Document.СделкаСМО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСМО</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаМНО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходПроцентовМНО/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Основание) Тогда // перезаполним документ, на основании МНО
		ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
		ОбъектНаСервере.Заполнить(ЭтаФорма.Параметры.Основание);
		
		ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
		
		ПриЧтенииСозданииНаСервере();
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("БанковкиеВыписки.Обновить");
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			Объект.СтрокаБанковскойВыписки   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура МНОПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МНО) Тогда
		Если Вопрос("Заполнить документ на основании выбранного МНО?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СтандартнаяОбработка = Ложь;
			ПерезаполнитьДокументНаОснованииМНО();
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ПерезаполнитьДокументНаОснованииМНО()
	
	ТекущийОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ПриходПроцентовМНО")); 
	ТекущийОбъект.Заполнить(Объект.МНО);            
	
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);

КонецПроцедуры // ПерезаполнитьДокументНаОснованииПоручения()

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	РеквизитыРасчетногоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РасчетныйСчет, Новый Структура("Контрагент", "Банк.ЮрФизЛицо"));
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма, Контрагент",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход"),
			Объект.Сумма,
			РеквизитыРасчетногоСчета.Контрагент),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
	
	Если ТипЗнч(ДанныеОбъекта.МНО) = Тип("ДокументСсылка.СделкаСМО") Тогда 
		Элементы.СуммаМНО.Видимость = Ложь;
	Иначе	
		Элементы.СуммаМНО.Видимость = Истина;
	КонецЕсли;	
			
КонецПроцедуры // НастроитьВидимостьИДоступность

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
